#Задача 1
#Напиши код, который проверяет, является ли число x положительным
x = 5

if x > 0:
  print("положительный")