#Списки

#Задача 1

x = 1
if x > 0:
    print('Число положительное')
